
command_value_text = {
    0x01: "车辆登人",
    0x02: "实时信息上报",
    0x03: "补发信息上报",
    0x04: "车辆登出",
    0x05: "平台登入",
    0x06: "平台登出",
    (0x07, 0x08): "终端数据预留",
    (0x09, 0x7F): "上行数据系统预留",
    (0x80, 0x82): "终端数据预留",
    (0x83, 0xBF): "下行数据系统预留",
    (0xC0, 0xFE): "平台交换自定义数据",
}

response_code_value_text = {
    0x01: "成功",
    0x02: "错误",
    0x03: "VIN重复",
    0xFE: "命令",
}

encryption_type_value_text = {
    0x01: "不加密",
    0x02: "RSA",
    0x03: "AES128",
    0xFE: "异常",
    0xFF: "无效",
}